micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_adc.h
/** @defgroup ADC_LL_EC_AWD_CHANNELS  Analog watchdog - Monitored channels
  * @{
  */
#define LL_ADC_AWD_DISABLE                 (0x00000000UL)                            /*!< ADC analog watchdog monitoring
                                           disabled */
#define LL_ADC_AWD_ALL_CHANNELS_REG        (ADC_AWD_CR23_CHANNEL_MASK \
                                            | ADC_CFGR1_AWD1EN)                      /*!< ADC analog watchdog monitoring
                                           of all channels, converted by group regular only */
#define LL_ADC_AWD_ALL_CHANNELS_INJ        (ADC_AWD_CR23_CHANNEL_MASK \
                                            | ADC_CFGR1_JAWD1EN)                     /*!< ADC analog watchdog monitoring
                                           of all channels, converted by group injected only */
#define LL_ADC_AWD_ALL_CHANNELS_REG_INJ    (ADC_AWD_CR23_CHANNEL_MASK \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN)  /*!< ADC analog watchdog monitoring
                                           of all channels, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_0_REG           (ADC_CHANNEL_0_NUMBER | ADC_CHANNEL_0_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN0, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_0_INJ           (ADC_CHANNEL_0_NUMBER | ADC_CHANNEL_0_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN0, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_0_REG_INJ       (ADC_CHANNEL_0_NUMBER | ADC_CHANNEL_0_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN0, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_1_REG           (ADC_CHANNEL_1_NUMBER | ADC_CHANNEL_1_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN1, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_1_INJ           (ADC_CHANNEL_1_NUMBER | ADC_CHANNEL_1_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN1, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_1_REG_INJ       (ADC_CHANNEL_1_NUMBER | ADC_CHANNEL_1_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN1, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_2_REG           (ADC_CHANNEL_2_NUMBER | ADC_CHANNEL_2_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN2, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_2_INJ           (ADC_CHANNEL_2_NUMBER | ADC_CHANNEL_2_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN2, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_2_REG_INJ       (ADC_CHANNEL_2_NUMBER | ADC_CHANNEL_2_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN2, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_3_REG           (ADC_CHANNEL_3_NUMBER | ADC_CHANNEL_3_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN3, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_3_INJ           (ADC_CHANNEL_3_NUMBER | ADC_CHANNEL_3_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN3, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_3_REG_INJ       (ADC_CHANNEL_3_NUMBER | ADC_CHANNEL_3_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN3, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_4_REG           (ADC_CHANNEL_4_NUMBER | ADC_CHANNEL_4_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN4, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_4_INJ           (ADC_CHANNEL_4_NUMBER | ADC_CHANNEL_4_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN4, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_4_REG_INJ       (ADC_CHANNEL_4_NUMBER | ADC_CHANNEL_4_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN4, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_5_REG           (ADC_CHANNEL_5_NUMBER | ADC_CHANNEL_5_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN5, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_5_INJ           (ADC_CHANNEL_5_NUMBER | ADC_CHANNEL_5_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN5, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_5_REG_INJ       (ADC_CHANNEL_5_NUMBER | ADC_CHANNEL_5_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN5, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_6_REG           (ADC_CHANNEL_6_NUMBER | ADC_CHANNEL_6_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN6, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_6_INJ           (ADC_CHANNEL_6_NUMBER | ADC_CHANNEL_6_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN6, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_6_REG_INJ       (ADC_CHANNEL_6_NUMBER | ADC_CHANNEL_6_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN6, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_7_REG           (ADC_CHANNEL_7_NUMBER | ADC_CHANNEL_7_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN7, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_7_INJ           (ADC_CHANNEL_7_NUMBER | ADC_CHANNEL_7_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN7, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_7_REG_INJ       (ADC_CHANNEL_7_NUMBER | ADC_CHANNEL_7_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN7, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_8_REG           (ADC_CHANNEL_8_NUMBER | ADC_CHANNEL_8_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN8, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_8_INJ           (ADC_CHANNEL_8_NUMBER | ADC_CHANNEL_8_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN8, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_8_REG_INJ       (ADC_CHANNEL_8_NUMBER | ADC_CHANNEL_8_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN8, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_9_REG           (ADC_CHANNEL_9_NUMBER | ADC_CHANNEL_9_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN9, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_9_INJ           (ADC_CHANNEL_9_NUMBER | ADC_CHANNEL_9_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN9, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_9_REG_INJ       (ADC_CHANNEL_9_NUMBER | ADC_CHANNEL_9_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN9, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_10_REG          (ADC_CHANNEL_10_NUMBER | ADC_CHANNEL_10_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN10, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_10_INJ          (ADC_CHANNEL_10_NUMBER | ADC_CHANNEL_10_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN10, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_10_REG_INJ      (ADC_CHANNEL_10_NUMBER | ADC_CHANNEL_10_BITFIELD\
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN10, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_11_REG          (ADC_CHANNEL_11_NUMBER | ADC_CHANNEL_11_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN11, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_11_INJ          (ADC_CHANNEL_11_NUMBER | ADC_CHANNEL_11_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN11, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_11_REG_INJ      (ADC_CHANNEL_11_NUMBER | ADC_CHANNEL_11_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN11, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_12_REG          (ADC_CHANNEL_12_NUMBER | ADC_CHANNEL_12_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN12, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_12_INJ          (ADC_CHANNEL_12_NUMBER | ADC_CHANNEL_12_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN12, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_12_REG_INJ      (ADC_CHANNEL_12_NUMBER | ADC_CHANNEL_12_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN12, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_13_REG          (ADC_CHANNEL_13_NUMBER | ADC_CHANNEL_13_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN13, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_13_INJ          (ADC_CHANNEL_13_NUMBER | ADC_CHANNEL_13_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN13, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_13_REG_INJ      (ADC_CHANNEL_13_NUMBER | ADC_CHANNEL_13_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN13, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_14_REG          (ADC_CHANNEL_14_NUMBER | ADC_CHANNEL_14_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN14, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_14_INJ          (ADC_CHANNEL_14_NUMBER | ADC_CHANNEL_14_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN14, converted by group only */
#define LL_ADC_AWD_CHANNEL_14_REG_INJ      (ADC_CHANNEL_14_NUMBER | ADC_CHANNEL_14_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN14, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_15_REG          (ADC_CHANNEL_15_NUMBER | ADC_CHANNEL_15_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           monitoring of ADC channel ADCx_IN15, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_15_INJ          (ADC_CHANNEL_15_NUMBER | ADC_CHANNEL_15_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN15, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_15_REG_INJ      (ADC_CHANNEL_15_NUMBER | ADC_CHANNEL_15_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN15, converted by either group
                                           regular or injected */
#define LL_ADC_AWD_CHANNEL_16_REG          (ADC_CHANNEL_16_NUMBER | ADC_CHANNEL_16_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN16, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_16_INJ          (ADC_CHANNEL_16_NUMBER | ADC_CHANNEL_16_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN16, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_16_REG_INJ      (ADC_CHANNEL_16_NUMBER | ADC_CHANNEL_16_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN16, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_17_REG          (ADC_CHANNEL_17_NUMBER | ADC_CHANNEL_17_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN17, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_17_INJ          (ADC_CHANNEL_17_NUMBER | ADC_CHANNEL_17_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN17, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_17_REG_INJ      (ADC_CHANNEL_17_NUMBER | ADC_CHANNEL_17_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN17, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_18_REG          (ADC_CHANNEL_18_NUMBER | ADC_CHANNEL_18_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN18, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_18_INJ          (ADC_CHANNEL_18_NUMBER | ADC_CHANNEL_18_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN18, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_18_REG_INJ      (ADC_CHANNEL_18_NUMBER | ADC_CHANNEL_18_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN18, converted by either group regular or injected */
#define LL_ADC_AWD_CHANNEL_19_REG          (ADC_CHANNEL_19_NUMBER | ADC_CHANNEL_19_BITFIELD \
                                            | ADC_CFGR1_AWD1EN | ADC_CFGR1_AWD1SGL)  /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN19, converted by group regular only */
#define LL_ADC_AWD_CHANNEL_19_INJ          (ADC_CHANNEL_19_NUMBER | ADC_CHANNEL_19_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1SGL) /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN19, converted by group injected only */
#define LL_ADC_AWD_CHANNEL_19_REG_INJ      (ADC_CHANNEL_19_NUMBER | ADC_CHANNEL_19_BITFIELD \
                                            | ADC_CFGR1_JAWD1EN | ADC_CFGR1_AWD1EN \
                                            | ADC_CFGR1_AWD1SGL)                     /*!< ADC analog watchdog monitoring
                                           of ADC channel ADCx_IN19, converted by either group regular or injected */
#define LL_ADC_AWD_CH_VREFINT_REG          LL_ADC_AWD_CHANNEL_17_REG                 /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal voltage reference,
                                           converted by group regular only */
#define LL_ADC_AWD_CH_VREFINT_INJ          LL_ADC_AWD_CHANNEL_17_INJ                 /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal voltage reference,
                                           converted by group injected only */
#define LL_ADC_AWD_CH_VREFINT_REG_INJ      LL_ADC_AWD_CHANNEL_17_REG_INJ             /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to VrefInt: Internal voltage reference,
                                           converted by either group regular or injected */
#define LL_ADC_AWD_CH_VBAT_REG             LL_ADC_AWD_CHANNEL_16_REG                 /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vbat/4: Vbat voltage through
                                           a divider ladder of factor 1/4 to have Vbat always below Vdda,
                                           converted by group regular only */
#define LL_ADC_AWD_CH_VBAT_INJ             LL_ADC_AWD_CHANNEL_16_INJ                 /*!< ADC analog watchdog monitoring
                                           of ADC internal channel connected to Vbat/4: Vbat voltage through
                                           a divider ladder of factor 1/4 to have Vbat always below Vdda,
