micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_ll_adc.h
/** @defgroup ADC_LL_EC_MULTI_DATA_FORMAT  Multimode - Data format
  * @{
  */
#define LL_ADC_MULTI_REG_DATA_EACH_ADC     (0x00000000UL)                      /*!< ADC multimode group regular
                                           data format: conversion data in data register of each ADC instance.
                                           If ADC data transfer by DMA is used: each ADC uses its own DMA channel,
                                           with its individual DMA transfer settings. */
#define LL_ADC_MULTI_REG_DATA_COMMON_32B   (ADC_CCR_DAMDF_1)                   /*!< ADC multimode group regular
                                           data format: conversion data in two ADC common instance data registers
                                           (CDR, CDR2) with packing option on 32 bit. In register CDR,
                                           data packing on 32 bit: ADC master and slave data are concatenated
                                           (data master in [15; 0], data slave in [31; 16]), therefore data width
                                           must be lower than 16 bit (even with ADC resolution 12 bit,
                                           higher width reachable by post processing: oversampling, offset, ...).
                                           In register CDR2, data of master and slave are alternatively set in full
                                           register width 32 bit, therefore no constraint on data width.
                                           In case of usage with DMA, CDR generate ones transfer request
                                           and CDR2 two transfer requests per conversion. */
#define LL_ADC_MULTI_REG_DATA_COMMON_16B   (ADC_CCR_DAMDF_1 | ADC_CCR_DAMDF_0) /*!< ADC multimode group regular
                                           data format: conversion data in two ADC common instance data registers
                                           (CDR, CDR2) with packing option on 16 bit. In register CDR,
                                           data packing on 16 bit: ADC master and slave data are concatenated
                                           (data master in [7; 0], data slave in [15; 8]), therefore data width
                                           must be lower than 8 bit (even with ADC resolution 8 bit,
                                           higher width reachable by post processing: oversampling, offset, ...).
                                           In register CDR2, data of master and slave are alternatively set in full
                                           register width 32 bit, therefore no constraint on data width.
                                           In case of usage with DMA, CDR generate ones transfer request
                                           and CDR2 two transfer requests per conversion. */

/* Legacy literals */
#define LL_ADC_MULTI_REG_DMA_EACH_ADC LL_ADC_MULTI_REG_DATA_EACH_ADC
#define LL_ADC_MULTI_REG_DMA_RES_32B  LL_ADC_MULTI_REG_DATA_COMMON_32B
#define LL_ADC_MULTI_REG_DMA_RES_16B  LL_ADC_MULTI_REG_DATA_COMMON_16B
/**
  * @}
  */

/** @defgroup ADC_LL_EC_MULTI_TWOSMP_DELAY  Multimode - Delay between two sampling phases
  * @{
  */
#define LL_ADC_MULTI_TWOSMP_DELAY_1CYCLE   (0x00000000UL)                      /*!< ADC multimode interleaved delay
                                           between two sampling phases: 1 ADC clock cycle */
#define LL_ADC_MULTI_TWOSMP_DELAY_2CYCLES  (ADC_CCR_DELAY_0)                   /*!< ADC multimode interleaved delay
                                           between two sampling phases: 2 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_3CYCLES  (ADC_CCR_DELAY_1)                   /*!< ADC multimode interleaved delay
                                           between two sampling phases: 3 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_4CYCLES  (ADC_CCR_DELAY_1 | ADC_CCR_DELAY_0) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 4 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_5CYCLES  (ADC_CCR_DELAY_2)                   /*!< ADC multimode interleaved delay
                                           between two sampling phases: 5 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_6CYCLES  (ADC_CCR_DELAY_2 | ADC_CCR_DELAY_0) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 6 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_7CYCLES  (ADC_CCR_DELAY_2 | ADC_CCR_DELAY_1) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 7 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_8CYCLES  (ADC_CCR_DELAY_2 | ADC_CCR_DELAY_1 \
                                            | ADC_CCR_DELAY_0)                  /*!< ADC multimode interleaved delay
                                           between two sampling phases: 8 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_9CYCLES  (ADC_CCR_DELAY_3)                   /*!< ADC multimode interleaved delay
                                           between two sampling phases: 9 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_10CYCLES (ADC_CCR_DELAY_3 | ADC_CCR_DELAY_0) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 10 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_11CYCLES (ADC_CCR_DELAY_3 | ADC_CCR_DELAY_1) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 11 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_12CYCLES (ADC_CCR_DELAY_3 | ADC_CCR_DELAY_1 \
                                            | ADC_CCR_DELAY_0)                  /*!< ADC multimode interleaved delay
                                           between two sampling phases: 12 ADC clock cycles */
#define LL_ADC_MULTI_TWOSMP_DELAY_13CYCLES (ADC_CCR_DELAY_3 | ADC_CCR_DELAY_2) /*!< ADC multimode interleaved delay
                                           between two sampling phases: 13 ADC clock cycles */
/**
  * @}
  */

/** @defgroup ADC_LL_EC_MULTI_MASTER_SLAVE  Multimode - ADC master or slave
  * @{
  */
#define LL_ADC_MULTI_MASTER                (ADC_CDR_RDATA_MST) /*!< In multimode, selection among several ADC
                                           instances: ADC master */
#define LL_ADC_MULTI_SLAVE                 (ADC_CDR_RDATA_SLV) /*!< In multimode, selection among several ADC
                                           instances: ADC slave */
#define LL_ADC_MULTI_MASTER_SLAVE          (ADC_CDR_RDATA_SLV \
                                            | ADC_CDR_RDATA_MST) /*!< In multimode, selection among several ADC
                                           instances: both ADC master and ADC slave */
/**
  * @}
  */

#endif /* ADC_MULTIMODE_SUPPORT */

/** @defgroup ADC_LL_EC_HW_DELAYS  Definitions of ADC hardware constraints delays
  * @note   Only ADC peripheral HW delays are defined in ADC LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Note: Only ADC peripheral HW delays are defined in ADC LL driver driver,   */
/*       not timeout values.                                                  */
/*       Timeout values for ADC operations are dependent to device clock      */
/*       configuration (system clock versus ADC clock),                       */
/*       and therefore must be defined in user application.                   */
/*       Indications for estimation of ADC timeout delays, for this           */
/*       STM32 series:                                                        */
/*       - ADC calibration time: maximum delay is 16384/fADC.                 */
/*         (refer to device datasheet, parameter "tCAL")                      */
/*       - ADC enable time: maximum delay is 1 conversion cycle.              */
/*         (refer to device datasheet, parameter "tSTAB")                     */
/*       - ADC disable time: maximum delay should be a few ADC clock cycles   */
/*       - ADC stop conversion time: maximum delay should be a few ADC clock  */
/*         cycles                                                             */
/*       - ADC conversion time: duration depending on ADC clock and ADC       */
/*         configuration.                                                     */
/*         (refer to device reference manual, section "Timing")               */

